<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8a112173e76bb609710a42fd2b09ab7f65367307859e4346b0966e0f302fb0be","plan_job_ref":"Job Plan Airflow DAGs #248 at https://github.com/cal-itp/data-infra/actions/runs/16209351229","plan_out_hash":"dde102e4298d1e42af6ddb40f342f61b227885ab8d0d1b4042bd23c8400a82e6","plan_hash":"b60456eada074fdaf91775ecae88c56db664ee27cc2e16c2ed884eaa5268af20","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #248](https://github.com/cal-itp/data-infra/actions/runs/16209351229)